odin/sampleblogger/app/controllers/tags_controller.rb

  def index
    @tag = Tag.all
---
SELECT "tags".* FROM "tags"

  def destroy
    @tag = Tag.find(params[:id])
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT 1  [["id", 0]]