odin/members-only/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    @post.save
---
INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Jing"], ["body", "Jong"], ["user_id", 1], ["created_at", "2015-08-09 03:52:52.594225"], ["updated_at", "2015-08-09 03:52:52.594225"]]