odin/re-former/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "aajsdfksjdkf"], ["email", "abce@yahoo.com"], ["password", "aslkdjf;asjdf3"], ["created_at", "2015-07-28 18:01:10.670425"], ["updated_at", "2015-07-28 18:01:10.670425"]]
---
  def create
    @user = User.new(user_params)
    if @user.save